//HERC01XX JOB (HERC01),                  
//             'JCL EXEMPLO',             
//             CLASS=A,                   
//             MSGCLASS=H,                
//             REGION=8M,TIME=1440,       
//             NOTIFY=HERC01              
//COMPILA  EXEC COBOL,                    
//         PROG='PROG1',                  
//         BIBF='HERC01.COBOL',           
//         BIBC='HERC01.LOAD'             
