//HERC01XX JOB (HERC01),            
//             'JCL EXEMPLO',       
//             CLASS=A,             
//             MSGCLASS=H,          
//             REGION=8M,TIME=1440, 
//             NOTIFY=HERC01        
//EXECUTA  EXEC PGM=IEFBR14        
