       IDENTIFICATION     DIVISION.          
       PROGRAM-ID. PROG1.                    
       ENVIRONMENT        DIVISION.          
       DATA               DIVISION.          
       PROCEDURE          DIVISION.          
           DISPLAY '--PRIMEIRO PROGRAMA--'.  
           STOP RUN.                         
